In [1]:
import pandas as pd

In [2]:
data = {
    'Fruits': ['Apple', 'Grape', 'Pear', 'Banana', 'Orange'],
    'Price': [400, 500, 2000, 300, 250],
    'Quantity': [5,10, 6, 8, 12]
}

df = pd.DataFrame(data)
df = df.set_index('Fruits')
df

        Price  Quantity
Fruits
Apple     400         5
Grape     500        10
Pear     2000         6
Banana    300         8
Orange    250        12

In [3]:
#loc
df.loc[['Apple', 'Grape']]

        Price  Quantity
Fruits
Apple     400         5
Grape     500        10

In [4]:
# iloc: uses index position
df.iloc[[0,1]]

        Price  Quantity
Fruits
Apple     400         5
Grape     500        10

In [5]:
# select some or all row and a column

df.loc[ : ,['Price']]

        Price
Fruits
Apple     400
Grape     500
Pear     2000
Banana    300
Orange    250

In [6]:
## print out the index, column of df

df.columns
df.index

Index(['Apple', 'Grape', 'Pear', 'Banana', 'Orange'], dtype='object', name='Fruits')

In [7]:
# using np to get sqrt

import numpy as np
np.sqrt(df['Price'])

Fruits
Apple     20.000000
Grape     22.360680
Pear      44.721360
Banana    17.320508
Orange    15.811388
Name: Price, dtype: float64

In [8]:
df['Price'].mean()

np.float64(690.0)

In [9]:
# getting mean of all columns
df.mean(axis = 0)

Price       690.0
Quantity      8.2
dtype: float64

### Missing Value

In [10]:
df.loc['Pineapple'] = [None, None]
df.loc['Avocado'] = [None, None]

In [11]:
df.isnull()  # check for missing value

           Price  Quantity
Fruits
Apple      False     False
Grape      False     False
Pear       False     False
Banana     False     False
Orange     False     False
Pineapple   True      True
Avocado     True      True

In [12]:
df.isnull().sum()

Price       2
Quantity    2
dtype: int64

## Preview the df

In [13]:
# top n rows
df.head(1)

       Price Quantity
Fruits
Apple    400        5

In [14]:
# bottom n rows
df.tail(1)

        Price Quantity
Fruits
Avocado  None     None

In [15]:
df

          Price Quantity
Fruits
Apple       400        5
Grape       500       10
Pear       2000        6
Banana      300        8
Orange      250       12
Pineapple  None     None
Avocado    None     None

In [16]:
df.describe()

        Price  Quantity
count       5         5
unique      5         5
top       400         5
freq        1         1

In [17]:
df['Price'].value_counts()

Price
400     1
500     1
2000    1
300     1
250     1
Name: count, dtype: int64

### Grouping

In [18]:
df

          Price Quantity
Fruits
Apple       400        5
Grape       500       10
Pear       2000        6
Banana      300        8
Orange      250       12
Pineapple  None     None
Avocado    None     None

### Multi Index df

In [ ]:
df = pd.DataFrame(
    np.random.random()
)